Autodesk.Revit.DB.CADLinkOptions.ViewId
The id of the view to use as the link's reference view, if the
reference view has been deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.CADLinkOptions.#ctor(System.Boolean,Autodesk.Revit.DB.ElementId)
Creates a CADLinkOptions object, specifying whether to preserve
graphic overrides, and what view to use if the link's view has been
deleted.
preserveOverrides:
True if Revit should preserve the link's graphic overrides on reload.
False otherwise.
viewId:
The id of the view to use as the link's reference view, if the reference
view has been deleted. Revit will ignore this value if the reference
view is still in place.
The value may be ElementId.InvalidElementId, although Revit will
cancel the load if the reference view is deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.CADLinkOptions.#ctor(Autodesk.Revit.DB.CADLinkOptions)
Constructs a new copy of the input CADLinkOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018